* Build

#+begin_src docker-build :dir .
FROM alpine:latest
#+end_src


* Build & Tag

#+begin_src docker-build :dir . :tag testimage:latest
FROM alpine:latest
#+end_src

* Build, Tag, and Push

 #+begin_src docker-build :dir . :tag testimage:latest :push ifitzpat/testimage:latest
FROM alpine:latest
#+end_src

#+RESULTS:
: docker push ifitzpat/testimage:latest
